"""
CREDIT
KODE BY [AMANG] <https://t.me/amwang> <https://github.com/amanqs>
HAPUS CREDIT?, WAH KEBANGETAN SIH.
"""


from ubot import *

__MODULE__ = "​Reminders​"
__HELP__ = """
ᴍᴏᴅᴜʟ ɪɴɪ ᴍᴇᴍᴜɴɢᴋɪɴᴋᴀɴ ᴘᴇɴɢɢᴜɴᴀ ᴜɴᴛᴜᴋ ᴍᴇɴɢᴀᴛᴜʀ ᴘᴇɴɢɪɴɢᴀᴛ.

⌑ ​🇵​​🇪​​🇷​​🇮​​🇳​​🇹​​🇦​​🇭​⦂ `{0}​🇷​​🇪​​🇲​​🇮​​🇳​​🇩​`
⌑ ᴘᴇɴᴊᴇʟᴀꜱᴀɴ: ᴍᴇɴɢᴀᴛᴜʀ ᴘᴇɴɢɪɴɢᴀᴛ ᴜɴᴛᴜᴋ ᴡᴀᴋᴛᴜ ᴛᴇʀᴛᴇɴᴛᴜ ᴅɪ ᴍᴀꜱᴀ ᴅᴇᴘᴀɴ.

ᴘᴇɴɢɢᴜɴᴀᴀɴ: `{0}ʀᴇᴍɪɴᴅ <ᴡᴀᴋᴛᴜ> <ᴘᴇꜱᴀɴ>`
ᴄᴏɴᴛᴏʜ:
`{0}ʀᴇᴍɪɴᴅ 1ᴊ30ᴍ ʙᴇʟɪ ꜱᴜꜱᴜ`

`{0}ʀᴇᴍɪɴᴅ 1ʜ30ᴍ ᴄᴇᴋ ᴇᴍᴀɪʟ`

ᴄᴀᴛᴀᴛᴀɴ: ᴀʀɢᴜᴍᴇɴ ᴡᴀᴋᴛᴜ ᴍᴇɴᴅᴜᴋᴜɴɢ ʙᴇʀʙᴀɢᴀɪ ꜰᴏʀᴍᴀᴛ ꜱᴇᴘᴇʀᴛɪ ᴊᴀᴍ (ᴊ), ᴍᴇɴɪᴛ (ᴍ), ᴅᴀɴ ʜᴀʀɪ (ʜ).

⌑ ᴘᴇʀɪɴᴛᴀʜ: `{0}ʟɪꜱᴛʀᴇᴍɪɴᴅ`
⌑ ᴘᴇɴᴊᴇʟᴀꜱᴀɴ: ᴍᴇɴᴀᴍᴘɪʟᴋᴀɴ ᴅᴀꜰᴛᴀʀ ᴘᴇɴɢɪɴɢᴀᴛ ʏᴀɴɢ ᴛᴇʀꜱɪᴍᴘᴀɴ.

ᴘᴇɴɢɢᴜɴᴀᴀɴ: `{0}ʟɪꜱᴛʀᴇᴍɪɴᴅ`
ᴜɴᴛᴜᴋ ᴍᴇɴɢᴀᴛᴜʀ ᴘᴇɴɢɪɴɢᴀᴛ, ɢᴜɴᴀᴋᴀɴ ᴘᴇʀɪɴᴛᴀʜ `{0}ʀᴇᴍɪɴᴅ` ᴅɪɪᴋᴜᴛɪ ᴏʟᴇʜ ᴡᴀᴋᴛᴜ ᴅᴀɴ ᴘᴇꜱᴀɴ ʏᴀɴɢ ᴅɪɪɴɢɪɴᴋᴀɴ. ᴀʀɢᴜᴍᴇɴ ᴡᴀᴋᴛᴜ ʜᴀʀᴜꜱ ᴅɪꜱᴇᴅɪᴀᴋᴀɴ ᴅᴀʟᴀᴍ ꜰᴏʀᴍᴀᴛ ʏᴀɴɢ ᴅɪꜱᴇʙᴜᴛᴋᴀɴ ᴅɪ ᴀᴛᴀꜱ. ᴘᴇɴɢɪɴɢᴀᴛ ᴀᴋᴀɴ ᴅɪᴋɪʀɪᴍ ᴘᴀᴅᴀ ᴡᴀᴋᴛᴜ ʏᴀɴɢ ᴅɪᴛᴇɴᴛᴜᴋᴀɴ ᴅᴇɴɢᴀɴ ᴘᴇꜱᴀɴ ʏᴀɴɢ ᴅɪʙᴇʀɪᴋᴀɴ.

ᴜɴᴛᴜᴋ ᴍᴇʟɪʜᴀᴛ ᴅᴀꜰᴛᴀʀ ᴘᴇɴɢɪɴɢᴀᴛ ʏᴀɴɢ ᴛᴇʀꜱɪᴍᴘᴀɴ, ɢᴜɴᴀᴋᴀɴ ᴘᴇʀɪɴᴛᴀʜ `{0}ʟɪꜱᴛʀᴇᴍɪɴᴅ`.
"""


@PY.UBOT("remind", sudo=True)
async def _(client, message):
    await reminder(client, message)


@PY.UBOT("listremind", sudo=True)
async def _(client, message):
    await listrem(client, message)
