from ubot import *

__MODULE__ = "ShowID"
__HELP__ = """
ʙᴀɴᴛᴜᴀɴ ᴜɴᴛᴜᴋ ꜱʜᴏᴡ ɪᴅ

⌑ ᴘᴇʀɪɴᴛᴀʜ: <ᴄᴏᴅᴇ>{0}ɪᴅ</ᴄᴏᴅᴇ>
⌑ ᴘᴇɴᴊᴇʟᴀꜱᴀɴ: ᴜɴᴛᴜᴋ ᴍᴇɴɢᴇᴛᴀʜᴜɪ ɪᴅ ᴅᴀʀɪ ᴜꜱᴇʀ/ɢʀᴜᴘ/ᴄʜᴀɴɴᴇʟ.

⌑ ᴘᴇʀɪɴᴛᴀʜ: <ᴄᴏᴅᴇ>{0}ɪᴅ</ᴄᴏᴅᴇ> [ʀᴇᴘʟʏ ᴛᴏ ᴜꜱᴇʀ/ᴍᴇᴅɪᴀ]
⌑ ᴘᴇɴᴊᴇʟᴀꜱᴀɴ: ᴜɴᴛᴜᴋ ᴍᴇɴɢᴇᴛᴀʜᴜɪ ɪᴅ ᴅᴀʀɪ ᴜꜱᴇʀ/ᴍᴇᴅɪᴀ.

⌑ ᴘᴇʀɪɴᴛᴀʜ: <ᴄᴏᴅᴇ>{0}ɢᴇᴛɪᴅ</ᴄᴏᴅᴇ> [ᴜꜱᴇʀɴᴀᴍᴇ ᴜꜱᴇʀ/ɢʀᴜᴘ/ᴄʜᴀɴɴᴇʟ].
⌑ ᴘᴇɴᴊᴇʟᴀꜱᴀɴ: ᴜɴᴛᴜᴋ ᴍᴇɴɢᴇᴛᴀʜᴜɪ ɪᴅ ᴜꜱᴇʀ/ɢʀᴜᴘ/ᴄʜᴀɴɴᴇʟ ᴍᴇʟᴀʟᴜɪ ᴜꜱᴇʀɴᴀᴍᴇ ᴅᴇɴɢᴀɴ ꜱɪᴍʙᴏʟ @.
"""


@PY.UBOT("id", sudo=True)
async def _(client, message):
    await id_cmd(client, message)
